In [16]:
import pandas as pd

In [17]:
data ={"name":["a","b","c","d","a","c"], "eng":[8,7,5,8,8,4],"ban":[2,3,4,5,2,6]}

In [18]:
df = pd.DataFrame(data)
df

  name  eng  ban
0    a    8    2
1    b    7    3
2    c    5    4
3    d    8    5
4    a    8    2
5    c    4    6

In [19]:
 df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [20]:
df

  name  eng  ban
0    a    8    2
1    b    7    3
2    c    5    4
3    d    8    5
4    a    8    2
5    c    4    6

In [21]:
df.drop_duplicates(keep="first")

  name  eng  ban
0    a    8    2
1    b    7    3
2    c    5    4
3    d    8    5
5    c    4    6

In [27]:
ds = pd.read_csv("titanic.csv")
ds.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
ds.shape

(891, 12)

In [33]:
ds.drop_duplicates(inplace =True)

In [34]:
ds.shape

(891, 12)

In [ ]:
# that csv file has no duplicates